output/posts/2017-09-06-buffer-switching-in-spacemacs-is-slowing-me-down.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Buffer switching in Spacemacs is slowing me down | The journal that counts</title>
<link href="../assets/css/bootstrap.min.css" rel="stylesheet" type="text/css">
<link href="../assets/css/html4css1.css" rel="stylesheet" type="text/css">
<link href="../assets/css/nikola_rst.css" rel="stylesheet" type="text/css">
<link href="../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../assets/css/colorbox.css" rel="stylesheet" type="text/css">
<link href="../assets/css/theme.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../rss.xml">
<link rel="canonical" href="https://example.com/posts/2017-09-06-buffer-switching-in-spacemacs-is-slowing-me-down.html">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Pieter Swinkels">
<link rel="prev" href="2017-08-31-spacemacs-and-the-super-star----.html" title="Spacemacs and the super star (*)" type="text/html">
<link rel="next" href="2017-09-06-clean-code-episode-7--architecture--use-cases-and-high-level-design.html" title="Clean Code episode 7: Architecture, Use Cases and High Level Design" type="text/html">
<meta property="og:site_name" content="The journal that counts">
<meta property="og:title" content="Buffer switching in Spacemacs is slowing me down">
<meta property="og:url" content="https://example.com/posts/2017-09-06-buffer-switching-in-spacemacs-is-slowing-me-down.html">
<meta property="og:description" content="Buffer switching in Spacemacs is slowing me down


While working on code, I noticed that buffer switching in Spacemacs seemed more
time consuming than I remembered from my handcrafted Emacs setup. I c">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-09-06T13:38:00+02:00">
<meta property="article:tag" content="spacemacs">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">The journal that counts</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../archive.html">Archive</a>
                </li>
<li>
<a href="../categories/index.html">Tags</a>
                </li>
<li>
<a href="../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="2017-09-06-buffer-switching-in-spacemacs-is-slowing-me-down.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="#" class="u-url">Buffer switching in Spacemacs is slowing me down</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    <a href="../authors/pieter-swinkels.html">Pieter Swinkels</a>
            </span></p>
            <p class="dateline"><a href="#" rel="bookmark"><time class="published dt-published" datetime="2017-09-06T13:38:00+02:00" itemprop="datePublished" title="2017-09-06 13:38">2017-09-06 13:38</time></a></p>
            
        <p class="sourceline"><a href="2017-09-06-buffer-switching-in-spacemacs-is-slowing-me-down.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Buffer switching in Spacemacs is slowing me down</h2>
<div class="outline-text-2" id="text-1">
<p>
While working on code, I noticed that buffer switching in Spacemacs seemed more
time consuming than I remembered from my handcrafted Emacs setup. I could not
quite put my finger on what was causing it. One obvious difference is that the
key binding for <code>C-x b</code>, by default <code>helm-mini</code>, whereas I used
<code>ido-switch-buffer</code>.
</p>

<p>
I found the following information in the documentation of an older Spacemacs
clone at <a href="https://github.com/bobbyangelov">https://github.com/bobbyangelov</a>:
</p>
<blockquote>
<p>
Some users prefer the <code>ido</code> way of navigating the file system because it can
remember the last selected directories and buffers and RET is used to open
directories insteas of <code>TAB</code> and <code>C-z</code> in helm. It is possible to use <code>ido</code>
[…] by setting the variable <code>dotspacemacs-use-ido</code> to <code>t</code>.
</p>
</blockquote>
<p>
The memory feature of <code>ido</code> might explain why I seemed to need less key strokes
for a buffer swith than with <code>helm</code>. And the difference between <code>ret</code> and <code>tab</code>
in <code>helm</code> had already bitten me multiple times when using <code>fgrep</code>. Unfortunately
variable <code>dotspacemacs-use-ido</code> does not seem to exist anymore in the current
version of Spacemacs.
</p>

<p>
Then I found <a href="https://github.com/emacs-helm/helm/issues/1492">an issue</a> in the Helm GitHub repo that indicates that as soon as a
user enters a pattern for the buffer list, the buffer list is sorted using the
length of the buffer name (huh?). As long as the user has not entered a pattern, the
buffers seem to be ordered most-recently-used first. I tried this in my current
Spacemacs installation, and it indeed works like that.
</p>

<p>
The function that handles the ordering is defined like this in my current
Spacemacs installation:
</p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="nf">defun</span> <span class="nv">helm-buffers-sort-transformer</span> <span class="p">(</span><span class="nf">candidates</span> <span class="nv">source</span><span class="p">)</span>
  <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nf">string=</span> <span class="nv">helm-pattern</span> <span class="s">""</span><span class="p">)</span>
      <span class="nv">candidates</span>
      <span class="p">(</span><span class="k">if </span><span class="nv">helm-buffers-fuzzy-matching</span>
	  <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">helm-pattern</span> <span class="p">(</span><span class="nf">helm-buffers--pattern-sans-filters</span><span class="p">)))</span>
	    <span class="p">(</span><span class="nf">funcall</span> <span class="nv">helm-fuzzy-sort-fn</span> <span class="nv">candidates</span> <span class="nv">source</span><span class="p">))</span>
	  <span class="p">(</span><span class="nf">sort</span> <span class="nv">candidates</span>
		<span class="p">(</span><span class="k">lambda </span><span class="p">(</span><span class="nf">s1</span> <span class="nv">s2</span><span class="p">)</span>
		  <span class="p">(</span><span class="nb">&lt; </span><span class="p">(</span><span class="nf">string-width</span> <span class="nv">s1</span><span class="p">)</span> <span class="p">(</span><span class="nf">string-width</span> <span class="nv">s2</span><span class="p">)))))))</span>
</pre></div>
<p>
So it is a bit more complicated: as soon as the user has entered a pattern and
<code>helm-buffers-fuzzy-matching</code> does not hold, the buffer list is sorted using the
length of the buffer name. In case <code>helm-buffers-fuzzy-matching</code> holds, sorting
depends on the definition of <code>helm-fuzzy-sort-fn</code> and then it is off down the
rabbit hole.
</p>

<p>
So I decided to follow the suggestion in the aforementioned GitHub issue and
advice <code>helm-buffers-sort-transformer</code> to always return the buffer names in the
most-recently-used first order:
</p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="nf">defun</span> <span class="nv">sks-buffers-nosort-transformer</span> <span class="p">(</span><span class="nf">_</span> <span class="nv">candidates</span> <span class="nv">_</span><span class="p">)</span>
  <span class="nv">candidates</span><span class="p">)</span>

<span class="p">(</span><span class="nf">advice-add</span> <span class="ss">'helm-buffers-sort-transformer</span> <span class="nv">:around</span> <span class="ss">'sks-buffers-nosort-transformer</span><span class="p">)</span>
</pre></div>
<p>
This works fine, apart from one little thing that puzzled me when I checked the
order of the buffers: the buffer list always shows the current buffer at the
bottom of the list.
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../categories/spacemacs.html" rel="tag">spacemacs</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="2017-08-31-spacemacs-and-the-super-star----.html" rel="prev" title="Spacemacs and the super star (*)">Previous post</a>
            </li>
            <li class="next">
                <a href="2017-09-06-clean-code-episode-7--architecture--use-cases-and-high-level-design.html" rel="next" title="Clean Code episode 7: Architecture, Use Cases and High Level Design">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:swinkels.pieter@yahoo.com">Pieter Swinkels</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../assets/js/jquery.min.js"></script><script src="../assets/js/bootstrap.min.js"></script><script src="../assets/js/moment-with-locales.min.js"></script><script src="../assets/js/fancydates.js"></script><script src="../assets/js/jquery.colorbox-min.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
